/*-----------------------------------------------------------------------------------------------------
【平    台】CCS
【适 用 单 片 机】msp432P401R
【底 层 库】TIVA WARE /msp432p4xx
【开 发】e芯工作室
/*@@ 库仅供参考 后果自负
 *
 * 版本 v1.0
 * 时间 2021年2月24日13:12:44
-------------------------------------------------------------------------------------------------------*/

/*-----------------------------------------------------------------------------------------------------
超声波测试例程
TRIG P1.6
ECHO P1.7
-------------------------------------------------------------------------------------------------------*/
#include "exinlibs\headfile.h"

int lineda=0;
int flag=0;
void testline()
{
    if(!flag)
    {
        lineda++;
    }
    if(flag)
    {
        lineda--;
    }
    if(lineda==123)
    {
        flag=1;
    }
    if(lineda==30)
    {
        flag=0;
    }
}
Oscill oscill1;//定义示波器结构体
void main()
{
    system_init(1);//初始化滴答计时器
	set_DCO_48MH();
	//ADC_TEST();
	Rotate_INIT();
	ADC_INIT();
	Oscill_Init(&oscill1,100,20,53,0,10);//初始示波器
	//UART0_init();
	while(1)
	{
	   // delay_ms(1);
	   // testline();
	    Oscill_show(&oscill1, GET_ADC_VALUE(ADC_CHA));
	    //bianmaqi_tiaocan();
	}
}
